OpenFOAM-6-cantera/tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(side|outlet)"
    {
        type            prghTotalHydrostaticPressure;
        p0              $internalField;
        value           $internalField;
    }

    ground
    {
        type            fixedFluxPressure;
    }

    inlet
    {
        type            fixedFluxPressure;
    }

    region0_to_pyrolysisRegion_coupledWall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}


// ************************************************************************* //
